//---------------------------------------------------------------------------
#pragma once
//---------------------------------------------------------------------------
#include <vector>
//---------------------------------------------------------------------------


// Базовый интерфейс предикторов
class i_predictor 
{
  public:

    using features = std::vector<double>;

    virtual ~i_predictor() {};
    
    virtual double predict(const features&) const = 0;
};
//---------------------------------------------------------------------------